hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
// @brief Build the high-pass coefficients for a corner at hz, or disable it.
static void hpf_setup(uint16_t hz) {
    s_hpfX1 = s_hpfX2 = s_hpfY1 = s_hpfY2 = 0.0f;
    s_hpfOn = (hz > 0);
    if (!s_hpfOn)
        return;

    // Bilinear transform of a second-order Butterworth high-pass.
    const float k = tanf((float)M_PI * (float)hz / (float)MODEM_DEMOD_SAMPLERATE);
    const float q = 1.41421356f; // 1 / Q, Q = 1/sqrt(2)
    const float norm = 1.0f / (1.0f + q * k + k * k);
    s_hpfB0 = norm;
    s_hpfB1 = -2.0f * norm;
    s_hpfB2 = norm;
    s_hpfA1 = 2.0f * (k * k - 1.0f) * norm;
    s_hpfA2 = (1.0f - q * k + k * k) * norm;
}

static void hpf_run(float *buf, int len) {
    for (int i = 0; i < len; i++) {
        float x = buf[i];
        float y = s_hpfB0 * x + s_hpfB1 * s_hpfX1 + s_hpfB2 * s_hpfX2 - s_hpfA1 * s_hpfY1 - s_hpfA2 * s_hpfY2;
        s_hpfX2 = s_hpfX1;
        s_hpfX1 = x;
        s_hpfY2 = s_hpfY1;
        s_hpfY1 = y;
        buf[i] = y;
    }
}

// @brief Build the tone-band meter coefficients and clear its state.
//
// Constant-peak-gain band-pass from the bilinear transform, at the demodulator
// sample rate the decimated signal runs at.
static void band_meter_setup(void) {
    const float f0 = sqrtf(BAND_METER_LO_HZ * BAND_METER_HI_HZ);
    const float w0 = 2.0f * (float)M_PI * f0 / (float)MODEM_DEMOD_SAMPLERATE;
    const float alpha = sinf(w0) / (2.0f * BAND_METER_Q);
    const float a0 = 1.0f + alpha;

    s_bandB0 = alpha / a0;
    s_bandB2 = -alpha / a0;
    s_bandA1 = -2.0f * cosf(w0) / a0;
    s_bandA2 = (1.0f - alpha) / a0;
    memset(s_bandX1, 0, sizeof(s_bandX1));
    memset(s_bandX2, 0, sizeof(s_bandX2));
    memset(s_bandY1, 0, sizeof(s_bandY1));
    memset(s_bandY2, 0, sizeof(s_bandY2));
}

// @brief RMS of a decimated block through the tone-band meter, in ADC counts.
//
// Reads buf without changing it; only the meter's own filter state advances.
static float band_meter_run(const float *buf, int len) {
    float sumSq = 0.0f;

    for (int i = 0; i < len; i++) {
        float v = buf[i];
        for (int st = 0; st < 2; st++) {
            float y = s_bandB0 * v + s_bandB2 * s_bandX2[st] - s_bandA1 * s_bandY1[st] - s_bandA2 * s_bandY2[st];
            s_bandX2[st] = s_bandX1[st];
            s_bandX1[st] = v;
            s_bandY2[st] = s_bandY1[st];
            s_bandY1[st] = y;
            v = y;
        }
        sumSq += v * v;
    }

    return (len > 0) ? sqrtf(sumSq / (float)len) * 2048.0f : 0.0f;
}

// @brief Hand one block to the demodulators at the current gain.
//
// demodulate() is documented for <= 13 bit input, and filterRun() accumulates
// coeff*sample in an int32 across up to MODEM_RX_BPF_TAPS_MAX taps. Clamping
// here keeps both safe no matter what the gain or a hot input does.
static void demod_feed(const float *buf, int len) {
    const float scale = s_agcGain * 2048.0f;

    for (int i = 0; i < len; i++) {
        float v = buf[i] * scale;
        if (v > 2047.0f)
            v = 2047.0f;
        else if (v < -2047.0f)
            v = -2047.0f;
        MODEM_DECODE((int16_t)v, (uint16_t)s_mVrms);
    }
}

// @brief Keep a decimated block received while the gate was closed.
static void hold_push(const float *buf, int len) {
    memcpy(s_hold[s_holdHead], buf, (size_t)len * sizeof(float));
    s_holdHead = (uint8_t)((s_holdHead + 1) % RX_HOLD_BLOCKS);
    if (s_holdCount < RX_HOLD_BLOCKS)
        s_holdCount++;
}

// @brief Demodulate the held blocks, oldest first, and empty the ring.
static void hold_flush(int len) {
    uint8_t slot = (uint8_t)((s_holdHead + RX_HOLD_BLOCKS - s_holdCount) % RX_HOLD_BLOCKS);

    for (uint8_t n = 0; n < s_holdCount; n++) {
        demod_feed(s_hold[slot], len);
        slot = (uint8_t)((slot + 1) % RX_HOLD_BLOCKS);
    }
    s_holdCount = 0;
}

// Anti-alias FIR for the MODEM_ADC_SAMPLERATE -> 9600 Hz decimation.
//
// What sets the requirement is where the out-of-band noise lands after the
// decimation, not the 4800 Hz Nyquist frequency. At 9600 Hz everything
// between 7000 and 12200 Hz folds straight onto the 900-2600 Hz band the
// demodulators work in - 7400 Hz onto the 2200 Hz space tone, 8400 Hz onto the
// 1200 Hz mark tone - and the demodulators' own band-pass runs after the
// decimation, so it cannot tell the folded noise from signal. A discriminator
// output makes this the dominant noise term: FM noise density rises with the
// square of the frequency, so the 7-12 kHz region carries far more noise than
// the tone band does.
//
// The filter is therefore a Blackman-windowed sinc with its cutoff at 3500 Hz,
// normalized to unity gain at DC: -0.5 dB at 1200 Hz, -1.8 dB at 2200 Hz,
// -2.7 dB at 2600 Hz, and at least 44 dB of rejection from 7000 Hz upwards
// (54 dB at 7400 Hz). A band-pass after the decimation removes what remains
// between 2600 and 4800 Hz; the 1.4 dB of tilt between the two tones is well
// inside what the demodulator set absorbs.
//
// The rejection depends on the length of the filter in samples, which is why
// every ratio has its own set: at 76800 Hz it takes 48 taps, at 38400 Hz the
// same response needs 24. Host simulation of the whole receive chain with
// discriminator noise puts the decoder within the frame-count scatter of
// Direwolf's multi-slicer demodulator down to 6 dB of in-band SNR with the
// 48-tap set, where an 8:1 filter with 10 dB of rejection at 7400 Hz already
// fails at 9 dB.
//
// Only every MODEM_RESAMPLE_RATIO-th output is computed, so the cost is
// FILTER_TAPS multiplies per 9600 Hz output sample.
#if MODEM_RESAMPLE_RATIO == 8
#define FILTER_TAPS 48
static const float resample_coeffs[FILTER_TAPS] = {
    0.000000000f,  0.000003683f,  -0.000012507f, -0.000096507f, -0.000300537f, -0.000670188f, -0.001227254f, -0.001947246f, -0.002735303f, -0.003406689f,
    -0.003679415f, -0.003185913f, -0.001507891f, 0.001766157f,  0.006966981f,  0.014265589f,  0.023604266f,  0.034653204f,  0.046805534f,  0.059217534f,
    0.070892558f,  0.080798540f,  0.088001577f,  0.091793827f,  0.091793827f,  0.088001577f,  0.080798540f,  0.070892558f,  0.059217534f,  0.046805534f,
    0.034653204f,  0.023604266f,  0.014265589f,  0.006966981f,  0.001766157f,  -0.001507891f, -0.003185913f, -0.003679415f, -0.003406689f, -0.002735303f,
    -0.001947246f, -0.001227254f, -0.000670188f, -0.000300537f, -0.000096507f, -0.000012507f, 0.000003683f,  0.000000000f,
};
#elif MODEM_RESAMPLE_RATIO == 4
#define FILTER_TAPS 24
static const float resample_coeffs[FILTER_TAPS] = {
    0.000000000f, -0.000056586f, -0.000751303f, -0.002751272f, -0.005664650f, -0.006679907f, -0.000180160f, 0.020181109f,
    0.057093324f, 0.105480602f,  0.152206614f,  0.181122228f,  0.181122228f,  0.152206614f,  0.105480602f,  0.057093324f,
    0.020181109f, -0.000180160f, -0.006679907f, -0.005664650f, -0.002751272f, -0.000751303f, -0.000056586f, 0.000000000f,
};
#elif MODEM_RESAMPLE_RATIO == 1
#define FILTER_TAPS 1
static const float resample_coeffs[FILTER_TAPS] = { 1.0f };
#else
#error "No decimation FIR for this MODEM_RESAMPLE_RATIO. Design one with at least 40 dB of rejection from 7000 Hz upwards at the new input rate."
#endif

#if FILTER_TAPS > 1
// The last FILTER_TAPS - 1 raw samples of the previous block, prepended
// ahead of this one so the filter has real data to draw on instead of
// zeros at the join. A decimator fed block-by-block must carry this
// history between calls.
static float s_resampleTail[FILTER_TAPS - 1];

// Staging area for the two history runs resample_audio() reads (see below).
// Static rather than automatic: at 48 taps it is 376 bytes, which the receive
// task's stack does not need to carry.
static float s_resampleHist[2 * (FILTER_TAPS - 1)];
#endif

