hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
    // A genuine state change (this is what setPtt() uses to reflect PTT
    // on/off). A real transition is always applied: packets are transmitted
    // one at a time with a real PTT-off in between (see Ax25TransmitCheck()),
    // and back-to-back packets in a burst can toggle PTT on/off/on again well
    // within 100 ms, so this LED (and anything wired the same way, e.g. a PTT
    // relay) must follow the real GPIO, which is driven separately by
    // setPtt(). Only the 100 ms window before the NEXT transition is rate-
    // limited, and only for repeats of this same new state.
    rgbTimeout = now + 100;
    r_old = r;
    g_old = g;
    b_old = b;

#if MODEM_LED_TX_GPIO >= 0
    gpio_ll_set_level(&GPIO, (uint32_t)MODEM_LED_TX_GPIO, r > 0);
#endif
#if MODEM_LED_RX_GPIO >= 0
    gpio_ll_set_level(&GPIO, (uint32_t)MODEM_LED_RX_GPIO, g > 0);
#endif
}

// IRAM_ATTR: called from dac_timer_isr() -> MODEM_BAUDRATE_TIMER_HANDLER() ->
// Ax25GetTxBit() at key-down (setPtt(false)), same ISR context as the rest of
// the TX path. Must stay flash-cache-safe for the same reason as
// LED_Status2() above.
void IRAM_ATTR setPtt(bool state) {
    // s_pttGpio is a compile-time constant (::MODEM_PTT_GPIO), so only the
    // polarity needs to be snapshotted under the spinlock
    // AFSK_setPttActiveHigh() uses - short enough to be fine from IRAM/ISR
    // context, and it can never observe a half-applied change.
    portENTER_CRITICAL_ISR(&s_pttMux);
    bool activeHigh = s_pttActiveHigh;
    portEXIT_CRITICAL_ISR(&s_pttMux);

    if (s_pttGpio >= 0)
        gpio_ll_set_level(&GPIO, (uint32_t)s_pttGpio, activeHigh ? state : !state);
    if (state)
        LED_Status2(255, 0, 0);
    else
        LED_Status2(0, 0, 0);
}

bool getTransmit(void) {
    return s_txActive;
}

bool AFSK_TxTeardownPending(void) {
    return s_txStopPending;
}

// @brief Key up / key down.
//
// setTransmit(true) is only ever reached from ModemTransmitStart(), i.e. task
// context, so the timer may be started here. setTransmit(false) is reached from
// the DAC ISR via Ax25GetTxBit() -> ModemTransmitStop(), so it must do nothing
// more than lower a flag; AFSK_ServiceTx() finishes the job from a task.
void IRAM_ATTR setTransmit(bool val) {
    if (val) {
        if (!s_txActive) {
            s_txStopPending = false;
            s_txActive = true;
            if (s_dacTimer && !s_dacTimerRunning) {
                gptimer_start(s_dacTimer);
                s_dacTimerRunning = true;
            }
        }
    } else {
        s_txActive = false;
        // Drop the PTT GPIO right here, at key-down. This is the only teardown
        // step that is safe to run from the DAC ISR: setPtt() is IRAM_ATTR and
        // does nothing heavier than a spinlock-guarded gpio_set_level() (the
        // status LED it also touches is compiled out when MODEM_LED_*_GPIO are
        // -1). The rest of the teardown - stopping the DAC sample timer,
        // parking the DAC, flushing the RX FIFO - is NOT ISR-safe and stays
        // deferred to AFSK_ServiceTx() via s_txStopPending below.
        //
        // The pin drop must NOT be deferred with it: AFSK_ServiceTx() runs at
        // most once per service-task period (>= 1 tick) and behind an unbounded
        // RX-drain loop, so deferring the pin would leave the PTT line
        // physically asserted for up to a whole tick after the transmitter had
        // already stopped modulating (s_txActive == false), letting "PTT OFF
        // (unkeyed)" be reached while the pin was still keyed. Releasing it
        // here keeps the physical PTT in lock-step with key-down. The
        // idempotent setPtt(false) in AFSK_ServiceTx() re-asserts the idle
        // level as a belt-and-suspenders measure.
        setPtt(false);
        s_txStopPending = true;
    }
}

void afskSetFullDuplex(bool enable) {
    s_fullDuplex = enable;
    Ax25Config.fullDuplex = enable ? 1 : 0;
}

bool afskGetFullDuplex(void) {
    return s_fullDuplex;
}

void afskSetRxFrontEnd(uint16_t gateMv, uint16_t hpfHz, bool agcFixed, int8_t fixedGainDb) {
    s_pendGateMv = gateMv;
    s_pendHpfHz = hpfHz;
    s_pendAgcFixed = agcFixed;
    s_pendFixedGainDb = fixedGainDb;
}

uint32_t afskGetFifoDrops(void) {
    return s_fifoDrops;
}

uint32_t afskGetPoolOverflows(void) {
    return s_poolOvf;
}

void afskResetRxCounters(void) {
    s_fifoDrops = 0;
    s_poolOvf = 0;
}

esp_err_t afskSetDacSampleRate(uint32_t rate) {
    if (s_inited)
        return ESP_ERR_INVALID_STATE;

    // The modulator puts one symbol edge on a whole number of DAC samples at
    // every supported baud rate, and ModemInit() derives the divider by integer
    // division, so a rate that is not a multiple of 9600 desynchronizes the
    // 9600 Bd profile and a rate that is not a multiple of 1200 desynchronizes
    // the AFSK ones.
    if ((rate == 0) || ((rate % 9600) != 0) || ((rate % 1200) != 0))
        return ESP_ERR_INVALID_ARG;

    s_dacRate = rate;
    return ESP_OK;
}

uint32_t afskGetDacSampleRate(void) {
    return s_dacRate;
}

void afskSetDacAmplitude(uint8_t pct) {
    if (pct < 1)
        pct = 1;
    else if (pct > 100)
        pct = 100;

    s_dacAmplitudePct = pct;
}

uint8_t afskGetDacAmplitude(void) {
    return s_dacAmplitudePct;
}

esp_err_t afskSetAdcSelfBias(bool enable) {
#if (MODEM_ADC_GPIO == 32) || (MODEM_ADC_GPIO == 33)
    esp_err_t err;

    if (enable) {
        err = rtc_gpio_pullup_en((gpio_num_t)MODEM_ADC_GPIO);
        if (err == ESP_OK)
            err = rtc_gpio_pulldown_en((gpio_num_t)MODEM_ADC_GPIO);
    } else {
        err = rtc_gpio_pullup_dis((gpio_num_t)MODEM_ADC_GPIO);
        if (err == ESP_OK)
            err = rtc_gpio_pulldown_dis((gpio_num_t)MODEM_ADC_GPIO);
    }

    if (err != ESP_OK) {
        ESP_LOGE(TAG, "ADC input self-bias on GPIO%d: %s", MODEM_ADC_GPIO, esp_err_to_name(err));
        return err;
    }

    s_adcSelfBias = enable;
    ESP_LOGI(TAG, "ADC input self-bias %s on GPIO%d", enable ? "enabled" : "disabled", MODEM_ADC_GPIO);
    return ESP_OK;
#else
    // GPIO34-39 are input-only pads and carry no pull resistors at all, so an
    // AC-coupled input on one of them can only be biased externally.
    if (!enable) {
        s_adcSelfBias = false;
        return ESP_OK;
    }

    ESP_LOGE(TAG, "ADC input self-bias is not available on GPIO%d: that pad has no internal pull resistors", MODEM_ADC_GPIO);
    return ESP_ERR_NOT_SUPPORTED;
#endif
}

