hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/afsk.c
    adc_cali_line_fitting_config_t caliCfg = {
        .unit_id = ADC_UNIT_1,
        .atten = MODEM_ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_12,
    };
    err = adc_cali_create_scheme_line_fitting(&caliCfg, &s_cali);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "adc_cali_create_scheme_line_fitting: %s", esp_err_to_name(err));
        return err;
    }

    // Slope of the calibration line, for the tone-band meter, which works in
    // ADC counts. Measured between two codes well inside the linear part of
    // the range.
    int mvLo = 0, mvHi = 0;
    if ((adc_cali_raw_to_voltage(s_cali, 1000, &mvLo) == ESP_OK) && (adc_cali_raw_to_voltage(s_cali, 3000, &mvHi) == ESP_OK) && (mvHi > mvLo))
        s_mvPerCount = (float)(mvHi - mvLo) / 2000.0f;

    return adc_continuous_start(s_adc);
}

// ------------------------------------------------------------------
// RX DSP
// ------------------------------------------------------------------

void AFSK_Poll(void) {
    int16_t adc = 0;
    int mV = 0;
    long mVsum = 0;
    int mVsumCount = 0;

    for (;;) {
        // Only the consumer may move tail, so a flush requested by another task
        // is executed here, between blocks.
        if (s_flushReq) {
            s_flushReq = false;
            s_fifo.tail = s_fifo.head;
        }

        if (rb_size(&s_fifo) < (uint32_t)MODEM_BLOCK_SIZE)
            break;

        mVsum = 0;
        mVsumCount = 0;

        int16_t rawMin = INT16_MAX;
        int16_t rawMax = INT16_MIN;

        // The RMS/level measurement only needs a fraction of the samples.
        int m = ((MODEM_RESAMPLE_RATIO > 1) || (ModemConfig.modem == MODEM_MODEM_G3RUH)) ? 4 : 1;

        for (int x = 0; x < MODEM_BLOCK_SIZE; x++) {
            if (!rb_pop(&s_fifo, &adc))
                break;

            // running DC average
            s_avgSum += adc - (int)s_avgBuf[s_avgIdx];
            s_avgBuf[s_avgIdx++] = (uint16_t)adc;
            if (s_avgIdx >= AVG_N)
                s_avgIdx -= AVG_N;
            s_avg = (uint16_t)(s_avgSum / AVG_N);

            if (adc < rawMin)
                rawMin = adc;
            if (adc > rawMax)
                rawMax = adc;

            int adcVal = (int)adc - (int)s_avg;

            if (x % m == 0) {
                adc_cali_raw_to_voltage(s_cali, adc, &mV);
                mV -= s_offset;
                mVsum += (long)mV * mV; // Vrms = sqrt(1/n * sum(Vi^2))
                mVsumCount++;
            }

            s_audio[x] = (float)adcVal / 2048.0f;
        }

        adc_cali_raw_to_voltage(s_cali, s_avg, &s_offset);

        if (rawMin <= rawMax) {
            s_rawMin = rawMin;
            s_rawMax = rawMax;

            if (s_clipWarn && ((rawMax >= AFSK_RAW_CLIP_HIGH) || (rawMin <= AFSK_RAW_CLIP_LOW))) {
                uint32_t now = (uint32_t)(esp_timer_get_time() / 1000);

                // Signed difference against a deadline, so the hold survives the
                // wrap of the millisecond counter.
                if ((int32_t)(s_clipNextWarnMs - now) <= 0) {
                    s_clipNextWarnMs = now + CLIP_WARN_HOLD_MS;
                    ESP_LOGW(TAG, "RX audio is over-range (raw %d..%d of 0..4095) - lower the receive level trimmer or the transceiver volume", rawMin, rawMax);
                }
            }
        }

        if (mVsumCount > 0)
            s_mVrms = (int)sqrtf((float)(mVsum / mVsumCount));

        // G3RUH is the one profile that is NOT decimated.
        //
        // The AFSK profiles are demodulated at MODEM_DEMOD_SAMPLERATE (9600 Hz),
        // so the MODEM_ADC_SAMPLERATE stream is low-pass filtered and decimated
        // by MODEM_RESAMPLE_RATIO first. G3RUH runs at 9600 Bd: decimating to
        // 9600 Hz would leave exactly one sample per symbol, which gives the
        // DPLL nothing to recover a clock from and puts the symbol rate at
        // Nyquist. Its demodulator is built for the raw MODEM_ADC_SAMPLERATE
        // stream instead - MODEM_RESAMPLE_RATIO samples per symbol, which is
        // what N9600 and the lpf9600 coefficients in modem.c are cut for.
        //
        // The anti-alias filter and the high-pass are skipped with it,
        // deliberately: the decimator's 3500 Hz cutoff sits well inside
        // G3RUH's own bandwidth, and a baseband NRZ signal carries energy
        // down to DC.
        //
        // The decimator and the high-pass run on every block, gate open or
        // not, so their history is current whenever the gate opens.
        const bool decimate = (ModemConfig.modem != MODEM_MODEM_G3RUH) && (MODEM_RESAMPLE_RATIO > 1);
        const int count = decimate ? RX_DECIM_SAMPLES : MODEM_BLOCK_SIZE;

        if (decimate) {
            resample_audio(s_audio);
            if (s_hpfOn)
                hpf_run(s_audio, count);
            s_bandMvRms = (int)(band_meter_run(s_audio, count) * s_mvPerCount + 0.5f);
        } else {
            s_bandMvRms = s_mVrms;
        }

        // The gate follows the tone band, so hum or bass alone cannot hold it
        // open and a quiet tone under a loud low end still opens it.
        if (s_gateOnMv > 0) {
            if (s_bandMvRms > (int)s_gateOnMv) {
                if (s_dcdCnt < 100)
                    s_dcdCnt++;
            } else if (s_bandMvRms < (int)s_gateOffMv) {
                if (s_dcdCnt > 0)
                    s_dcdCnt--;
            }
        }

        bool signalPresent = (s_gateOnMv == 0) || (s_dcdCnt > 3) || (ModemConfig.modem == MODEM_MODEM_G3RUH);

        if (signalPresent) {
            // Track the level only while there is something to track, and
            // before feeding, so the block that opened the gate is already
            // demodulated at the new gain.
            if (!s_agcFixed)
                update_agc(s_audio, (size_t)count);

            if (decimate && (s_holdCount > 0))
                hold_flush(count);
            demod_feed(s_audio, count);
        } else if (decimate) {
            hold_push(s_audio, count);
        }
    }
}

static void afsk_rx_task(void *arg) {
    (void)arg;

